Tekla Open API Reference for Tekla Structures 2025
LoadLine Properties
The LoadLine type exposes the following members.
Properties
Name | Description
AutomaticPrimaryAxisWeight
 The automatic primary axis weight.
 (Inherited from Load.)
BoundingBoxDx
 The dimension of the bounding box in the X direction.
 (Inherited from Load.)
BoundingBoxDy
 The dimension of the bounding box in the Y direction.
 (Inherited from Load.)
BoundingBoxDz
 The dimension of the bounding box in the Z direction.
 (Inherited from Load.)
CreateFixedSupportConditionsAutomatically
 Indicates whether fixed support conditions are created automatically.
 (Inherited from Load.)
DistanceA
 The distance a (for shortening or dividing the length of a line load).
DistanceB
 The distance b (for shortening or dividing the length of a line load).
FatherId
 The identifier of the father object that the load is attached to.
 (Inherited from Load.)
Group
 The load group object for the load.
 (Inherited from Load.)
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
LoadAttachment
 The load attachment.
 (Inherited from Load.)
LoadDispersionAngle
 The load dispersion angle.
 (Inherited from Load.)
LoadForm
 The load form.
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
P1
 The load magnitude vector at the start position. The values are given in the local coordinate system of the load (not in the current coordinate system).
P2
 The load magnitude vector at the end position. The values are given in the local coordinate system of the load (not in the current coordinate system).
PartFilter
 The part filter.
 (Inherited from Load.)
PartNames
 The part names.
 (Inherited from Load.)
Position1
 The first input position point.
Position2
 The second input position point.
PrimaryAxisDirection
 The vector for the primary axis direction.
 (Inherited from Load.)
Spanning
 The load spanning.
 (Inherited from Load.)
Torsion1
 The first torsion.
Torsion2
 The second torsion.
Weight
 The weight.
 (Inherited from Load.)
Top
See Also
Reference
LoadLine Class
Tekla.Structures.Model Namespace